tsebaschtian/libcanard_ESCNode_Cpp_STM32port/src/main.cpp
/*
  A simple example DroneCAN node implementing a 4-in-1 ESC using the C++ API

  This example implements 5 features:

   - announces on the bus using NodeStatus at 1Hz
   - answers GetNodeInfo requests
   - implements dynamic node allocation
   - listens for ESC RawCommand commands and extracts throttle levels
   - sends ESC Status messages (with synthetic data based on throttles)
   - a parameter server for reading and writing node parameters

  This example uses socketcan on Linux for CAN transport

  Example usage: ./esc_node vcan0
*/
/*
 This example application is distributed under the terms of CC0 (public domain dedication).
 More info: https://creativecommons.org/publicdomain/zero/1.0/
*/

// system includes
// #include <stdio.h>
// #include <stdlib.h>
// #include <time.h>
// #include <string.h>
// #include <assert.h>
// #include <errno.h>
// #include <stdbool.h>
#include <Arduino.h>
#include <ArduinoUniqueID.h>

// include the canard C++ APIs
#include <canard/publisher.h>
#include <canard/subscriber.h>
#include <canard/service_client.h>
#include <canard/service_server.h>
#include <canard/handler_list.h>
#include <canard/transfer_object.h>

// include the base canard API
#include <canard.h>

// we are using the socketcan driver
// #include <socketcan.h>
#include <STM32_CAN.h>
STM32_CAN Can(CAN1, DEF); // Use PA11/12 pins for CAN1.

// include the headers for the generated DroneCAN messages from the
// dronecan_dsdlc compiler
#include <dronecan_msgs.h>

/*
  in this example we will use dynamic node allocation if MY_NODE_ID is zero
 */
#define MY_NODE_ID 53

/*
  our preferred node ID if nobody else has it
 */
#define PREFERRED_NODE_ID 73

// implement a 4-in-1 ESC
#define NUM_ESCS 4

/*
  create a CanardInterface class for interfacing with the hardware
 */
class CanardInterface : public Canard::Interface
{
  friend class ESCNode;

  CanardInterface(uint8_t iface_index) : Interface(iface_index) {}

public:
  void init();

  // implement required interface functions
  bool broadcast(const Canard::Transfer &bcast_transfer) override;
  bool request(uint8_t destination_node_id, const Canard::Transfer &req_transfer) override;
  bool respond(uint8_t destination_node_id, const Canard::Transfer &res_transfer) override;

  void process(uint32_t duration_ms);

  static void onTransferReceived(CanardInstance *ins, CanardRxTransfer *transfer);
  static bool shouldAcceptTransfer(const CanardInstance *ins,
                                   uint64_t *out_data_type_signature,
                                   uint16_t data_type_id,
                                   CanardTransferType transfer_type,
                                   uint8_t source_node_id);

  uint8_t get_node_id() const override { return canard.node_id; }
  void set_node_id(uint8_t node_id)
  {
    canardSetLocalNodeID(&canard, node_id);
  }

private:
  uint8_t memory_pool[2048];
  CanardInstance canard;
  CanardTxTransfer tx_transfer;

  // we will use socketcan driver for this example
  // SocketCANInstance socketcan;
};

/*
  declare heads of handler and transfer lists
 */
DEFINE_HANDLER_LIST_HEADS();
DEFINE_TRANSFER_OBJECT_HEADS();

class ESCNode
{
public:
  void start_node();

  CanardInterface canard_iface{0};

  /*
    keep the state of 4 ESCs, simulating a 4 in 1 ESC node
  */
  struct esc_state
  {
    float throttle;
    uint64_t last_update_us;
  } escs[NUM_ESCS];

private:
  // declare publishers for outgoing messages
  Canard::Publisher<uavcan_protocol_NodeStatus> node_status{canard_iface};
  Canard::Publisher<uavcan_equipment_esc_Status> esc_status{canard_iface};

  // incoming messages
  void handle_RawCommand(const CanardRxTransfer &transfer, const uavcan_equipment_esc_RawCommand &cmd);
  Canard::ObjCallback<ESCNode, uavcan_equipment_esc_RawCommand> raw_command_cb{this, &ESCNode::handle_RawCommand};
  Canard::Subscriber<uavcan_equipment_esc_RawCommand> raw_command_listener{raw_command_cb, 0};

  // Node Info Server
  void handle_GetNodeInfo(const CanardRxTransfer &transfer, const uavcan_protocol_GetNodeInfoRequest &req);
  Canard::ObjCallback<ESCNode, uavcan_protocol_GetNodeInfoRequest> node_info_req_cb{this, &ESCNode::handle_GetNodeInfo};
  Canard::Server<uavcan_protocol_GetNodeInfoRequest> node_info_server{canard_iface, node_info_req_cb};

  // parameter server
  void handle_param_GetSet(const CanardRxTransfer &transfer, const uavcan_protocol_param_GetSetRequest &req);
  Canard::ObjCallback<ESCNode, uavcan_protocol_param_GetSetRequest> param_get_set_req_cb{this, &ESCNode::handle_param_GetSet};
  Canard::Server<uavcan_protocol_param_GetSetRequest> param_server{canard_iface, param_get_set_req_cb};
  void handle_param_ExecuteOpcode(const CanardRxTransfer &transfer, const uavcan_protocol_param_ExecuteOpcodeRequest &req);
  Canard::ObjCallback<ESCNode, uavcan_protocol_param_ExecuteOpcodeRequest> param_executeopcode_req_cb{this, &ESCNode::handle_param_ExecuteOpcode};
  Canard::Server<uavcan_protocol_param_ExecuteOpcodeRequest> param_opcode_server{canard_iface, param_executeopcode_req_cb};

  // handlers for dynamic node allocation (DNA)
  Canard::Publisher<uavcan_protocol_dynamic_node_id_Allocation> allocation_pub{canard_iface};
  void handle_DNA_Allocation(const CanardRxTransfer &transfer, const uavcan_protocol_dynamic_node_id_Allocation &msg);
  Canard::ObjCallback<ESCNode, uavcan_protocol_dynamic_node_id_Allocation> allocation_cb{this, &ESCNode::handle_DNA_Allocation};
  Canard::Subscriber<uavcan_protocol_dynamic_node_id_Allocation> allocation_listener{allocation_cb, 0};

  // DNA request call
  void request_DNA();

  void send_NodeStatus(void);
  void process1HzTasks(uint32_t timestamp_usec);
  void send_ESCStatus(void);

  // keep node_status around for updating status
  uavcan_protocol_NodeStatus node_status_msg;

  /*
    data for dynamic node allocation process
  */
  struct dna_data
  {
    uint32_t send_next_node_id_allocation_request_at_ms;
    uint32_t node_id_allocation_unique_id_offset;
  };
  dna_data DNA;

  static struct parameter
  {
    const char *name;
    enum uavcan_protocol_param_Value_type_t type;
    float value;
    float min_value;
    float max_value;
  } parameters[];
};

