tsebaschtian/libcanard_ESCNode_Cpp_STM32port/src/main.cpp
/*
  a set of parameters to present to the user. In this example we don't
  actually save parameters, this is just to show how to handle the
  parameter protocool
 */
ESCNode::parameter ESCNode::parameters[] = {
    {"CAN_NODE", UAVCAN_PROTOCOL_PARAM_VALUE_INTEGER_VALUE, MY_NODE_ID, 0, 127},
    {"MyPID_P", UAVCAN_PROTOCOL_PARAM_VALUE_REAL_VALUE, 1.2, 0.1, 5.0},
    {"MyPID_I", UAVCAN_PROTOCOL_PARAM_VALUE_REAL_VALUE, 1.35, 0.1, 5.0},
    {"MyPID_D", UAVCAN_PROTOCOL_PARAM_VALUE_REAL_VALUE, 0.025, 0.001, 1.0},
};

/*
  get a 64 bit monotonic timestamp in microseconds since start. This
  is platform specific
 */
static uint64_t micros64()
{
  static uint64_t overflowCounter = 0; // Counter for overflows
  static uint32_t lastMicros = 0;      // To store the last value of micros()

  uint32_t currentMicros = micros();

  // Check for wrap-around
  if (currentMicros < lastMicros)
  {
    overflowCounter++;
  }

  lastMicros = currentMicros;

  // Convert the current overflow count to microseconds and add the current micros() value
  uint64_t totalMicros = (static_cast<uint64_t>(overflowCounter) << 32) + currentMicros;

  return totalMicros;
}

/*
  get monotonic time in milliseconds since startup
 */
static uint32_t millis32()
{
  return static_cast<uint32_t>(millis());
}

/*
  get a 16 byte unique ID for this node, this should be based on the CPU unique ID or other unique ID
 */
// static void getUniqueID(uint8_t id[16])
// {
//   memset(id, 0, 16);
//   FILE *f = fopen("/etc/machine-id", "r");
//   if (f)
//   {
//     fread(id, 1, 16, f);
//     fclose(f);
//   }
// }
void getUniqueID(uint8_t id[16])
{
  memset(id, 0, 16);
  memcpy(id, UniqueID8, 8);
  memcpy(id + 8, UniqueID8, 8);
}

bool CanardInterface::broadcast(const Canard::Transfer &bcast_transfer)
{
  tx_transfer = {
    .transfer_type = bcast_transfer.transfer_type,
    .data_type_signature = bcast_transfer.data_type_signature,
    .data_type_id = bcast_transfer.data_type_id,
    .inout_transfer_id = bcast_transfer.inout_transfer_id,
    .priority = bcast_transfer.priority,
    .payload = (const uint8_t *)bcast_transfer.payload,
    .payload_len = uint16_t(bcast_transfer.payload_len),
#if CANARD_ENABLE_CANFD
    .canfd = bcast_transfer.canfd,
#endif
#if CANARD_ENABLE_DEADLINE
    .deadline_usec = micros64() + (bcast_transfer.timeout_ms * 1000),
#endif
#if CANARD_MULTI_IFACE
    .iface_mask = uint8_t((1 << num_ifaces) - 1),
#endif
  };
  // do canard broadcast
  bool success = canardBroadcastObj(&canard, &tx_transfer) > 0;
  return success;
}

bool CanardInterface::request(uint8_t destination_node_id, const Canard::Transfer &req_transfer)
{
  tx_transfer = {
    .transfer_type = req_transfer.transfer_type,
    .data_type_signature = req_transfer.data_type_signature,
    .data_type_id = req_transfer.data_type_id,
    .inout_transfer_id = req_transfer.inout_transfer_id,
    .priority = req_transfer.priority,
    .payload = (const uint8_t *)req_transfer.payload,
    .payload_len = uint16_t(req_transfer.payload_len),
#if CANARD_ENABLE_CANFD
    .canfd = req_transfer.canfd,
#endif
#if CANARD_ENABLE_DEADLINE
    .deadline_usec = micros64() + (req_transfer.timeout_ms * 1000),
#endif
#if CANARD_MULTI_IFACE
    .iface_mask = uint8_t((1 << num_ifaces) - 1),
#endif
  };
  // do canard request
  return canardRequestOrRespondObj(&canard, destination_node_id, &tx_transfer) > 0;
}

bool CanardInterface::respond(uint8_t destination_node_id, const Canard::Transfer &res_transfer)
{
  tx_transfer = {
    .transfer_type = res_transfer.transfer_type,
    .data_type_signature = res_transfer.data_type_signature,
    .data_type_id = res_transfer.data_type_id,
    .inout_transfer_id = res_transfer.inout_transfer_id,
    .priority = res_transfer.priority,
    .payload = (const uint8_t *)res_transfer.payload,
    .payload_len = uint16_t(res_transfer.payload_len),
#if CANARD_ENABLE_CANFD
    .canfd = res_transfer.canfd,
#endif
#if CANARD_ENABLE_DEADLINE
    .deadline_usec = micros64() + (res_transfer.timeout_ms * 1000),
#endif
#if CANARD_MULTI_IFACE
    .iface_mask = uint8_t((1 << num_ifaces) - 1),
#endif
  };
  // do canard respond
  return canardRequestOrRespondObj(&canard, destination_node_id, &tx_transfer) > 0;
}

// convenience macros
#define MIN(a, b) ((a) < (b) ? (a) : (b))
#define C_TO_KELVIN(temp) (temp + 273.15f)
#define ARRAY_SIZE(x) (sizeof(x) / sizeof(x[0]))

/*
  handle a GetNodeInfo request
 */
void ESCNode::handle_GetNodeInfo(const CanardRxTransfer &transfer, const uavcan_protocol_GetNodeInfoRequest &req)
{
  //Serial.println("handle get node info");
  uavcan_protocol_GetNodeInfoResponse node_info_rsp{};

  // fill in node name
  node_info_rsp.name.len = snprintf((char *)node_info_rsp.name.data, sizeof(node_info_rsp.name.data), "ESCNode");

  // fill in software and hardware versions
  node_info_rsp.software_version.major = 1;
  node_info_rsp.software_version.minor = 2;
  node_info_rsp.hardware_version.major = 3;
  node_info_rsp.hardware_version.minor = 7;
  getUniqueID(node_info_rsp.hardware_version.unique_id);
  node_info_rsp.status = node_status_msg;
  node_info_rsp.status.uptime_sec = millis32() / 1000UL;

  node_info_server.respond(transfer, node_info_rsp);
}

/*
  handle a ESC RawCommand request
*/
void ESCNode::handle_RawCommand(const CanardRxTransfer &transfer, const uavcan_equipment_esc_RawCommand &cmd)
{
  // remember the demand for the ESC status output
  const uint8_t num_throttles = MIN(cmd.cmd.len, NUM_ESCS);
  const uint64_t tnow = micros64();
  for (uint8_t i = 0; i < num_throttles; i++)
  {
    // convert throttle to -1.0 to 1.0 range
    escs[i].throttle = cmd.cmd.data[i] / 8192.0;
    escs[i].last_update_us = tnow;

    Serial.println(escs[i].throttle);
  }
}

/*
  handle parameter GetSet request
 */
void ESCNode::handle_param_GetSet(const CanardRxTransfer &transfer, const uavcan_protocol_param_GetSetRequest &req)
{
  struct parameter *p = nullptr;
  if (req.name.len != 0)
  {
    for (uint16_t i = 0; i < ARRAY_SIZE(parameters); i++)
    {
      if (req.name.len == strlen(parameters[i].name) &&
          strncmp((const char *)req.name.data, parameters[i].name, req.name.len) == 0)
      {
        p = &parameters[i];
        break;
      }
    }
  }
  else if (req.index < ARRAY_SIZE(parameters))
  {
    p = &parameters[req.index];
  }
  if (p != nullptr && req.name.len != 0 && req.value.union_tag != UAVCAN_PROTOCOL_PARAM_VALUE_EMPTY)
  {
    /*
      this is a parameter set command. The implementation can
      either choose to store the value in a persistent manner
      immediately or can instead store it in memory and save to permanent storage on a
     */
    switch (p->type)
    {
    case UAVCAN_PROTOCOL_PARAM_VALUE_INTEGER_VALUE:
      p->value = req.value.integer_value;
      break;
    case UAVCAN_PROTOCOL_PARAM_VALUE_REAL_VALUE:
      p->value = req.value.real_value;
      break;
    default:
      return;
    }
  }

