tsebaschtian/libcanard_ESCNode_Cpp_STM32port/src/main.cpp
  /*
    for both set and get we reply with the current value
   */
  uavcan_protocol_param_GetSetResponse pkt{};

  if (p != NULL)
  {
    pkt.value.union_tag = p->type;
    switch (p->type)
    {
    case UAVCAN_PROTOCOL_PARAM_VALUE_INTEGER_VALUE:
      pkt.value.integer_value = p->value;
      break;
    case UAVCAN_PROTOCOL_PARAM_VALUE_REAL_VALUE:
      pkt.value.real_value = p->value;
      break;
    default:
      return;
    }
    pkt.name.len = strlen(p->name);
    strcpy((char *)pkt.name.data, p->name);
  }

  param_server.respond(transfer, pkt);
} 

/*
  handle parameter executeopcode request
 */
void ESCNode::handle_param_ExecuteOpcode(const CanardRxTransfer &transfer, const uavcan_protocol_param_ExecuteOpcodeRequest &req)
{
  if (req.opcode == UAVCAN_PROTOCOL_PARAM_EXECUTEOPCODE_REQUEST_OPCODE_ERASE)
  {
    // here is where you would reset all parameters to defaults
  }
  if (req.opcode == UAVCAN_PROTOCOL_PARAM_EXECUTEOPCODE_REQUEST_OPCODE_SAVE)
  {
    // here is where you would save all the changed parameters to permanent storage
  }

  uavcan_protocol_param_ExecuteOpcodeResponse pkt{};
  pkt.ok = true;
  param_opcode_server.respond(transfer, pkt);
}

/*
  handle DNA allocation responses
 */
void ESCNode::handle_DNA_Allocation(const CanardRxTransfer &transfer, const uavcan_protocol_dynamic_node_id_Allocation &msg)
{
  if (canard_iface.get_node_id() != CANARD_BROADCAST_NODE_ID)
  {
    // already allocated
    return;
  }

  // Rule C - updating the randomized time interval
  DNA.send_next_node_id_allocation_request_at_ms =
      millis32() + UAVCAN_PROTOCOL_DYNAMIC_NODE_ID_ALLOCATION_MIN_REQUEST_PERIOD_MS +
      (random() % UAVCAN_PROTOCOL_DYNAMIC_NODE_ID_ALLOCATION_MAX_FOLLOWUP_DELAY_MS);

  if (transfer.source_node_id == CANARD_BROADCAST_NODE_ID)
  {
    Serial.printf("Allocation request from another allocatee\n");
    DNA.node_id_allocation_unique_id_offset = 0;
    return;
  }

  // Obtaining the local unique ID
  uint8_t my_unique_id[sizeof(msg.unique_id.data)];
  getUniqueID(my_unique_id);

  // Matching the received UID against the local one
  if (memcmp(msg.unique_id.data, my_unique_id, msg.unique_id.len) != 0)
  {
    Serial.printf("Mismatching allocation response\n");
    DNA.node_id_allocation_unique_id_offset = 0;
    // No match, return
    return;
  }

  if (msg.unique_id.len < sizeof(msg.unique_id.data))
  {
    // The allocator has confirmed part of unique ID, switching to
    // the next stage and updating the timeout.
    DNA.node_id_allocation_unique_id_offset = msg.unique_id.len;
    DNA.send_next_node_id_allocation_request_at_ms -= UAVCAN_PROTOCOL_DYNAMIC_NODE_ID_ALLOCATION_MIN_REQUEST_PERIOD_MS;

    Serial.printf("Matching allocation response: %d\n", msg.unique_id.len);
  }
  else
  {
    // Allocation complete - copying the allocated node ID from the message
    canard_iface.set_node_id(msg.node_id);
    Serial.printf("Node ID allocated: %d\n", msg.node_id);
  }
}

/*
  ask for a dynamic node allocation
 */
void ESCNode::request_DNA()
{
  const uint32_t now = millis32();

  DNA.send_next_node_id_allocation_request_at_ms =
      now + UAVCAN_PROTOCOL_DYNAMIC_NODE_ID_ALLOCATION_MIN_REQUEST_PERIOD_MS +
      (random() % UAVCAN_PROTOCOL_DYNAMIC_NODE_ID_ALLOCATION_MAX_FOLLOWUP_DELAY_MS);

  uint8_t my_unique_id[16];
  getUniqueID(my_unique_id);

  // send allocation message
  uavcan_protocol_dynamic_node_id_Allocation req{};

  req.node_id = PREFERRED_NODE_ID;
  req.first_part_of_unique_id = (DNA.node_id_allocation_unique_id_offset == 0);

  static const uint8_t MaxLenOfUniqueIDInRequest = 6;
  uint8_t uid_size = (uint8_t)(16 - DNA.node_id_allocation_unique_id_offset);

  if (uid_size > MaxLenOfUniqueIDInRequest)
  {
    uid_size = MaxLenOfUniqueIDInRequest;
  }

  req.unique_id.len = uid_size;
  memcpy(req.unique_id.data, &my_unique_id[DNA.node_id_allocation_unique_id_offset], uid_size);

  // Preparing for timeout; if response is received, this value will be updated from the callback.
  DNA.node_id_allocation_unique_id_offset = 0;

  allocation_pub.broadcast(req);
}

/*
  send the 1Hz NodeStatus message. This is what allows a node to show
  up in the DroneCAN GUI tool and in the flight controller logs
 */
void ESCNode::send_NodeStatus(void)
{
  node_status_msg.health = UAVCAN_PROTOCOL_NODESTATUS_HEALTH_OK;
  node_status_msg.mode = UAVCAN_PROTOCOL_NODESTATUS_MODE_OPERATIONAL;
  node_status_msg.sub_mode = 0;
  node_status_msg.uptime_sec = millis32() / 1000UL;

  node_status.broadcast(node_status_msg);
}

/*
  This function is called at 1 Hz rate from the main loop.
*/
void ESCNode::process1HzTasks(uint32_t timestamp_msec)
{
  /*
    Transmit the node status message
  */
  send_NodeStatus();
}

/*
  send ESC status at 50Hz
*/
void ESCNode::send_ESCStatus(void)
{
  // send a separate status packet for each ESC
  for (uint8_t i = 0; i < NUM_ESCS; i++)
  {
    uavcan_equipment_esc_Status pkt{};

    // make up some synthetic status data
    pkt.error_count = 0;
    pkt.voltage = 16.8 - 2.0 * escs[i].throttle;
    pkt.current = 20 * escs[i].throttle;
    pkt.temperature = C_TO_KELVIN(25.0);
    pkt.rpm = 10000 * escs[i].throttle;
    pkt.power_rating_pct = 100.0 * escs[i].throttle;

    esc_status.broadcast(pkt);
  }
}

/*
  Transmits all frames from the TX queue, receives up to one frame.
*/
// void CanardInterface::process(uint32_t timeout_msec)
//  {
//      // Transmitting
//      for (const CanardCANFrame* txf = NULL; (txf = canardPeekTxQueue(&canard)) != NULL;) {
//          const int16_t tx_res = socketcanTransmit(&socketcan, txf, 0);
//          if (tx_res != 0) {
//              canardPopTxQueue(&canard);
//          }
//      }

//     // Receiving
//     const uint32_t start_ms = millis32();
//     while (millis32() - start_ms < timeout_msec) {
//         CanardCANFrame rx_frame;
//         const int16_t rx_res = socketcanReceive(&socketcan, &rx_frame, timeout_msec);
//         if (rx_res > 0) {
//             canardHandleRxFrame(&canard, &rx_frame, micros64());
//         }
//     }
// }

void CanardInterface::process(uint32_t timeout_msec)
{
  // Transmitting
  for (const CanardCANFrame *txf = NULL; (txf = canardPeekTxQueue(&canard)) != NULL;)
  {
    static CAN_message_t CAN_TX_msg; // needs to be static

    CAN_TX_msg.flags.extended = true;
    CAN_TX_msg.id = txf->id;
    CAN_TX_msg.len = txf->data_len;
    memcpy(CAN_TX_msg.buf, txf->data, txf->data_len);

    Can.write(CAN_TX_msg);
    canardPopTxQueue(&canard);
  }

