tsebaschtian/libcanard_ESCNode_Cpp_STM32port/src/main.cpp
  // Receiving
  // const uint32_t start_ms = millis32();

  CanardCANFrame rx_frame;                                    // new canard frame for RX
  memset(rx_frame.data, 0x00, CANARD_CAN_FRAME_MAX_DATA_LEN); // fill data with zeros
  static CAN_message_t CAN_RX_msg;                            // new STM32_CAN frame for receiving, needs to be static
  const uint64_t timeStamp = micros64();

  bool rx_res = Can.read(CAN_RX_msg); // read from can interface
  if (rx_res > 0)
  {
    // translate STM32_CAN frame to canard frame
    rx_frame.id = CAN_RX_msg.id;
    rx_frame.id |= CANARD_CAN_FRAME_EFF;  // Set the EFF bit to 1
    rx_frame.id &= ~CANARD_CAN_FRAME_RTR; // Set the RTR bit to 0
    rx_frame.id &= ~CANARD_CAN_FRAME_ERR; // Set the ERR bit to 0
    rx_frame.data_len = CAN_RX_msg.len;
    rx_frame.iface_id = 0;
    memcpy(rx_frame.data, CAN_RX_msg.buf, CAN_RX_msg.len);

    if (true)
    {
      // Serial output for debug stuff
      Serial.print("Channel: ");
      Serial.print(CAN_RX_msg.bus);
      if (CAN_RX_msg.flags.extended == false)
      {
        Serial.print(" Standard ID:");
      }
      else
      {
        Serial.print(" Extended ID:");
      }
      Serial.print(CAN_RX_msg.id, HEX);

      Serial.print(" DLC: ");
      Serial.print(CAN_RX_msg.len);
      if (CAN_RX_msg.flags.remote == false)
      {
        Serial.print(" buf: ");
        for (int i = 0; i < CAN_RX_msg.len; i++)
        {
          Serial.print("0x");
          Serial.print(CAN_RX_msg.buf[i], HEX);
          if (i != (CAN_RX_msg.len - 1))
          {
            Serial.print(" ");
          }
        }
        Serial.println();
      }
      else
      {
        Serial.println(" Data: REMOTE REQUEST FRAME");
      }

      // same but for canard frame
      Serial.print("Canard frame: ");
      Serial.print(rx_frame.id, HEX);

      Serial.print(" DLC: ");
      Serial.print(rx_frame.data_len);

      Serial.print(" buf: ");
      for (int i = 0; i < rx_frame.data_len; i++)
      {
        Serial.print("0x");
        Serial.print(rx_frame.data[i], HEX);
        if (i != (rx_frame.data_len - 1))
        {
          Serial.print(" ");
        }
      }
      Serial.println();
    }
    delay(100);

    // handle the received frame
    Serial.println(timeStamp);
    delay(100);
    int16_t result = canardHandleRxFrame(&canard, &rx_frame, timeStamp);
    Serial.println(result);
  }
}

/*
  handle an incoming message
 */
void CanardInterface::onTransferReceived(CanardInstance *ins, CanardRxTransfer *transfer)
{
  Serial.println("onTransferReceived");
  CanardInterface *iface = (CanardInterface *)ins->user_reference;
  iface->handle_message(*transfer);
}

/*
  check if we want the message. This is based on what we have subscribed to
 */
bool CanardInterface::shouldAcceptTransfer(const CanardInstance *ins,
                                           uint64_t *out_data_type_signature,
                                           uint16_t data_type_id,
                                           CanardTransferType transfer_type,
                                           uint8_t source_node_id)
{
  Serial.println("shouldAcceptTransferBegin");
  delay(100);
  CanardInterface *iface = (CanardInterface *)ins->user_reference;
  bool res = iface->accept_message(data_type_id, *out_data_type_signature);
  Serial.print("shouldAcceptTransferEnd ");
  Serial.println(res);
  delay(100);
  return res;
}

/*
  Initializing the Libcanard instance.
*/
void CanardInterface::init()
{
  Can.begin();
  Can.setBaudRate(1000000);

  // int16_t res = socketcanInit(&socketcan, interface_name);
  // if (res < 0)
  // {
  //   (void)fprintf(stderr, "Failed to open CAN iface '%s'\n", interface_name);
  //   exit(1);
  // }

  // init canard object
  canardInit(&canard,
             memory_pool,
             sizeof(memory_pool),
             onTransferReceived,
             shouldAcceptTransfer,
             this);

  // set node ID if not doing DNA
  if (MY_NODE_ID > 0)
  {
    canardSetLocalNodeID(&canard, MY_NODE_ID);
  }
  else
  {
    Serial.printf("Waiting for DNA node ID allocation\n");
  }
}

/*
 Initializing the CAN backend driver; in this example we're using SocketCAN
 */
uint32_t next_1hz_service_at;
uint32_t next_50hz_service_at;

void ESCNode::start_node()
{
  canard_iface.process(1);

  const uint32_t ts = millis32();

  // see if we are still doing DNA
  if (canard_iface.get_node_id() == CANARD_BROADCAST_NODE_ID)
  {
    // we're still waiting for a DNA allocation of our node ID
    if (millis32() > DNA.send_next_node_id_allocation_request_at_ms)
    {
      request_DNA();
    }
  }
  else
  {
    if (ts >= next_1hz_service_at)
    {
      next_1hz_service_at += 1000;
      process1HzTasks(ts);
    }
    if (ts >= next_50hz_service_at)
    {
      next_50hz_service_at += 1000 / 50;
      send_ESCStatus();
    }
  }
}

// declare our ESC node
static ESCNode node;

/*
  main program
 */

void setup()
{
  Serial.begin(115200);
  Serial.println();
  Serial.println();

  // init the interface
  node.canard_iface.init();

  next_1hz_service_at = millis32();
  next_50hz_service_at = millis32();
}

void loop()
{
  node.start_node();
}